nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/lcd/SED1520.c
/**************************************************************************
 *                                                                         
 *   sed1520.c                                                             
 *   LCD display controller interface routines for graphics modules        
 *   with onboard SED1520 controller(s) in "write-only" setup              
 *                                                                         
 *   Version 1.02 (20051031)                                               
 *                                                                         
 *   For Atmel AVR controllers with avr-gcc/avr-libc                       
 *   Copyright (c) 2005                                                    
 *     Martin Thomas, Kaiserslautern, Germany                              
 *     <eversmith@heizung-thomas.de>                                       
 *     http://www.siwawi.arubi.uni-kl.de/avr_projects                      
 *
 *   Permission to use in NON-COMMERCIAL projects is herbey granted. For
 *   a commercial license contact the author.
 *
 *   The above copyright notice and this permission notice shall be included in all
 *   copies or substantial portions of the Software.
 *
 *   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 *   IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 *   FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 *   COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 *   IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 *   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *                                                                         
 *
 *   partly based on code published by:                                    
 *   Michael J. Karas and Fabian "ape" Thiele
 *
 *
 ***************************************************************************/

/* 
   An Emerging Display EW12A03LY 122x32 Graphics module has been used
   for testing. This module only supports "write". There is no option
   to read data from the SED1520 RAM. The SED1520 R/W line on the 
   module is bound to GND according to the datasheet. Because of this 
   Read-Modify-Write using the LCD-RAM is not possible with the 12A03 
   LCD-Module. So this library uses a "framebuffer" which needs 
   ca. 500 bytes of the AVR's SRAM. The libray can of cause be used 
   with read/write modules too.
*/

/* tab-width: 4 */

//#include <LPC213x.H>      
//#include <includes.h>

#include <stdint.h>
#include "sed1520.h"
#include "bmp.h"
#include "board.h"
#include "stm32f2xx.h"
#include "App_moduleConfig.h"

/* pixel level bit masks for display */
/* this array is setup to map the order */
/* of bits in a byte to the vertical order */
/* of bits at the LCD controller */
const unsigned char l_mask_array[8] = {0x01,0x02,0x04,0x08,0x10,0x20,0x40,0x80}; /* TODO: avoid or PROGMEM */

/* the LCD display image memory */
/* buffer arranged so page memory is sequential in RAM */
static unsigned char l_display_array[LCD_Y_BYTES][LCD_X_BYTES];

/* control-lines hardware-interface (only "write") */
#define LCD_CMD_MODE()     LCDCTRLPORT &= ~(1<<LCDCMDPIN)
#define LCD_DATA_MODE()    LCDCTRLPORT |=  (1<<LCDCMDPIN)
#define LCD_ENABLE_E1()    LCDCTRLPORT &= ~(1<<LCDE1PIN)
#define LCD_DISABLE_E1()   LCDCTRLPORT |=  (1<<LCDE1PIN)
#define LCD_ENABLE_E2()    LCDCTRLPORT &= ~(1<<LCDE2PIN)
#define LCD_DISABLE_E2()   LCDCTRLPORT |=  (1<<LCDE2PIN)




#define MR		(1<<15)
#define SHCP	(1<<12)
#define DS		(1<<14)
#define STCP1	(1<<15)
#define STCP2	(1<<13)


#define RST0	(1<<0)
#define E1		(1<<1)
#define E2		(1<<2)
#define RW		(1<<3)
#define A0		(1<<4)


#define pgm_read_byte(a)	(*(a))
#define pgm_read_word(a) (*(a))


//  设C9E8
u8 Dot_She[24]={0x10,0x00,0x11,0x00,0xF2,0x07,0x00,0x02,0x50,0x08,0xCF,0x08,0x41,0x05,0x41,0x02,0x4F,0x05,0xD0,0x08,0x10,0x08,0x00,0x00};


// 备B1B8
u8 Dot_Bei[24]={0x20,0x00,0x24,0x00,0xD2,0x0F,0x57,0x05,0x4A,0x05,0xCA,0x07,0x4A,0x05,0x56,0x05,0xD2,0x0F,0x20,0x00,0x20,0x00,0x00,0x00};

//自 D7D4 
u8 Dot_Zi[24]={0x00,0x00,0xFC,0x0F,0x24,0x09,0x24,0x09,0x26,0x09,0x25,0x09,0x24,0x09,0x24,0x09,0x24,0x09,0xFC,0x0F,0x00,0x00,0x00,0x00};

//检 BCEC 
u8 Dot_Jian[24]={0x88,0x00,0x68,0x00,0xFF,0x0F,0x48,0x00,0x10,0x09,0x28,0x0E,0xA4,0x08,0x23,0x0B,0x24,0x0C,0xA8,0x0B,0x10,0x08,0x00,0x00};


// 开BFAA
u8  Dot_Kai[24]={0x40,0x00,0x42,0x08,0x42,0x06,0xFE,0x01,0x42,0x00,0x42,0x00,0x42,0x00,0xFE,0x0F,0x42,0x00,0x42,0x00,0x40,0x00,0x00,0x00};



// 正D5FD
u8 Dot_Zheng[24]={0x00,0x08,0x02,0x08,0xE2,0x0F,0x02,0x08,0x02,0x08,0xFE,0x0F,0x42,0x08,0x42,0x08,0x42,0x08,0x42,0x08,0x00,0x08,0x00,0x00};

//  常 B3A3
u8 Dot_Chang[24]={0x0C,0x00,0x04,0x07,0x75,0x01,0x56,0x01,0x54,0x01,0xD7,0x0F,0x54,0x01,0x56,0x01,0x75,0x05,0x04,0x07,0x0C,0x00,0x00,0x00};

// 天CCEC
u8 Dot_Tian[24]={0x20,0x08,0x22,0x08,0x22,0x04,0x22,0x02,0xA2,0x01,0x7E,0x00,0xA2,0x01,0x22,0x02,0x22,0x04,0x22,0x08,0x20,0x08,0x00,0x00};

// 线CFDF
u8 Dot_Xian[24]={0x98,0x04,0xD4,0x04,0xB3,0x02,0x88,0x02,0x00,0x08,0x48,0x08,0x48,0x04,0xFF,0x03,0x24,0x05,0xA5,0x08,0x26,0x0E,0x00,0x00};

//短C2B7
u8 Dot_Duan [24]={0x9E,0x0F,0x12,0x08,0xF2,0x07,0x9E,0x04,0x48,0x00,0xC4,0x0F,0xAB,0x04,0x92,0x04,0xAA,0x04,0xC6,0x0F,0x40,0x00,0x00,0x00};

//路 B6CC 
u8 Dot_Lu[24]={0x48,0x08,0x47,0x06,0xFC,0x01,0x44,0x06,0x02,0x08,0x7A,0x09,0x4A,0x0A,0x4A,0x08,0x4A,0x0A,0x7A,0x09,0x02,0x08,0x00,0x00};

//  内C4DA
u8 Dot_Nei[24]={0x00,0x00,0xFC,0x0F,0x04,0x00,0x84,0x00,0x64,0x00,0x1F,0x00,0x24,0x00,0xC4,0x08,0x04,0x08,0xFC,0x0F,0x00,0x00,0x00,0x00};

// 部B2BF
u8 Dot_Bu[24]={0x20,0x00,0xAA,0x0F,0xB2,0x04,0xA3,0x04,0xB2,0x04,0xAA,0x0F,0x20,0x00,0xFE,0x0F,0x02,0x02,0x32,0x02,0xCE,0x01,0x00,0x00};

// 电B5E7
u8 Dot_Dian[24]={0xFC,0x03,0x24,0x01,0x24,0x01,0x24,0x01,0xFF,0x07,0x24,0x09,0x24,0x09,0x24,0x09,0xFC,0x09,0x00,0x08,0x00,0x0E,0x00,0x00};

// 池B3D8
u8 Dot_Chi[24]={0x22,0x04,0x44,0x02,0x40,0x00,0xFC,0x07,0x20,0x08,0x10,0x08,0xFF,0x0B,0x08,0x08,0x04,0x09,0xFC,0x09,0x00,0x0C,0x00,0x00};

// 供B9A9
u8 Dot_Gong[24]={0x10,0x00,0xFC,0x0F,0x83,0x08,0x88,0x04,0xFF,0x02,0x88,0x00,0x88,0x00,0x88,0x00,0xFF,0x02,0x88,0x04,0x80,0x08,0x00,0x00};

