nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/lcd/SED1520.c
// .
u8 Dot_dot[24]={0x00,0x00,0x00,0x00,0xC0,0x00,0x20,0x01,0x20,0x01,0xC0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};


void ControlBitShift(unsigned char data) 
{
	unsigned char i;
	
	//IOSET0	= STCP1;
	//IOCLR0 = STCP2;
	GPIO_SetBits(GPIOE,GPIO_Pin_15);
	GPIO_ResetBits(GPIOE,GPIO_Pin_13);
	
	for(i=0;i<8;i++)
		{
		//IOCLR0=SHCP;
		GPIO_ResetBits(GPIOE,GPIO_Pin_12);
		if(data&0x80)
			//IOSET0 = DS;
			GPIO_SetBits(GPIOE,GPIO_Pin_14);
		else
			//IOCLR0 = DS;
			GPIO_ResetBits(GPIOE,GPIO_Pin_14);
		//IOSET0 = SHCP;
		GPIO_SetBits(GPIOE,GPIO_Pin_12);
		data<<=1;
	}	
	//IOSET0 = STCP2;
	GPIO_SetBits(GPIOE,GPIO_Pin_13);
}


void DataBitShift(unsigned char data)
{
	unsigned char i;
	//IOCLR0 = STCP1;
	GPIO_SetBits(GPIOE,GPIO_Pin_13);
	GPIO_ResetBits(GPIOE,GPIO_Pin_15);
	for(i=0;i<8;i++)
		{
		//IOCLR0=SHCP;
		GPIO_ResetBits(GPIOE,GPIO_Pin_12);
		if(data&0x80)
			//IOSET0 = DS;
			GPIO_SetBits(GPIOE,GPIO_Pin_14);
		else
			//IOCLR0 = DS;
			GPIO_ResetBits(GPIOE,GPIO_Pin_14);
		//IOSET0 = SHCP;
		GPIO_SetBits(GPIOE,GPIO_Pin_12);
		data<<=1;
	}	
	//IOSET0 = STCP1;
	GPIO_SetBits(GPIOE,GPIO_Pin_15);
}
 
/* 
**
** low level routine to send a byte value 
** to the LCD controller control register. 
** entry argument is the data to output 
** and the controller to use
** 1: IC 1, 2: IC 2, 3: both ICs
**
*/
void lcd_out_ctl(const unsigned char cmd, const unsigned char ncontr)
{ 
	unsigned char ctr;
	unsigned int i;
	u8 cByte=0x60;    // Q6 是背光
// 	LCD_CMD_MODE();
//	LCDDATAPORT = cmd;

	   if(Q7_enable==1)
	   	    cByte|=0x80;
	   else
	   	    cByte&=~0x80;
	ControlBitShift(RST0|0x0|cByte);
	DataBitShift(cmd);
	ctr=RST0;
	if(ncontr&0x01){
	  ctr|=E1;
	}
	if(ncontr&0x02){
		ctr|=E2;
	}	
	ControlBitShift(ctr|cByte);
	//delay(1);
	for(i=0;i<0xf;i++){}
	ControlBitShift(RST0|0|cByte);
}

/* 
**
** low level routine to send a byte value 
** to the LCD controller data register. entry argument
** is the data to output and the controller-number
**
*/
void lcd_out_dat(const unsigned char dat, const unsigned char ncontr)
{ 
	unsigned char ctr;
	unsigned int i;
	u8 cByte=0x60;
//	LCD_DATA_MODE();
//   LCDDATAPORT = dat;
	   	//    cByte&=~0x20; 
	    if(Q7_enable==1)
	   	    cByte|=0x80;
	   else
	   	    cByte&=~0x80;

	ctr=RST0|A0;
	ControlBitShift(ctr|cByte);
	DataBitShift(dat);
	if(ncontr&0x01){
	  ctr|=E1;
	}
	if(ncontr&0x02){
		ctr|=E2;
	}
	ControlBitShift(ctr|cByte);
	//delay(1);
	for(i=0;i<0xf;i++){}
	ControlBitShift(RST0|A0|cByte); 
}


/*
** 
** routine to initialize the operation of the LCD display subsystem
**
*/
void lcd_init(void)
 { 
	//IODIR0	= MR|SHCP|DS|STCP1|STCP2;
	//IOSET0	= MR;
	//GPIO_SetBits(GPIOA,GPIO_Pin_15);

	lcd_out_ctl(0,3);
    lcd_out_ctl(LCD_RESET,3); 
    //delay_ms(1);//3
    
    lcd_out_ctl(LCD_DISP_ON,3);
    lcd_out_ctl(LCD_SET_ADC_NOR,3); // !
    lcd_out_ctl(LCD_SET_LINE+16,3);
    lcd_out_ctl(LCD_SET_PAGE+0,3);
    lcd_out_ctl(LCD_SET_COL,3);
	/*
	lcd_out_ctl(0,3);
	lcd_out_ctl(LCD_RESET,3);

	lcd_out_ctl(LCD_DISP_ON,3);
	lcd_out_ctl(LCD_SET_ADC_REV,3); // !
	lcd_out_ctl(LCD_SET_LINE+0,3);
	lcd_out_ctl(LCD_SET_PAGE+0,3);
	lcd_out_ctl(LCD_SET_COL+LCD_STARTCOL_REVERSE,3);
	*/
 } 
void lcd_RstLow(void)   
{
   ControlBitShift(0x60); //  开背光 
}

#ifdef LCD_DEBUG

/* fills complete area with pattern - direct to LCD-RAM */
void lcd_test(const unsigned char pattern)
 { unsigned char page, col;

	for (page=0; page<LCD_Y_BYTES; page++) 
    { lcd_out_ctl(LCD_SET_PAGE+page,3);
      lcd_out_ctl(LCD_SET_COL+LCD_STARTCOL_REVERSE,3); // !
      for (col=0; col<LCD_X_BYTES/2; col++) 
         lcd_out_dat(pattern,3);
		 
    }
 }

/* raw write to LCD-RAM - used for debugging */
void lcd_raw(const unsigned char page, const unsigned char col, const unsigned char nctrl, const unsigned char pattern)
 { lcd_out_ctl(LCD_SET_PAGE+page,nctrl);
   lcd_out_ctl(LCD_SET_COL+col,nctrl);	
   lcd_out_dat(pattern,nctrl);
 }

#endif /* LCD_DEBUG */


/* fill buffer and LCD with pattern */
void lcd_fill(const unsigned char pattern)
 { unsigned char page, col;

   lcd_init(); 
   lcd_out_ctl(LCD_DISP_OFF,3);
   for (page=0; page<LCD_Y_BYTES; page++) 
    { for (col=0; col<LCD_X_BYTES; col++) 
         l_display_array[page][col]=pattern;
    }
   lcd_update_all();
   lcd_out_ctl(LCD_DISP_ON,3);
 }

void lcd_fill_2(const unsigned char pattern,unsigned char Pag_start,unsigned char Pag_end,unsigned char Col_start,unsigned char col_end)
{
unsigned char page, col;

for (page=Pag_start; page<Pag_end; page++) 
	{ 
	for (col=Col_start; col<col_end; col++) 
		l_display_array[page][col]=pattern;
	}
lcd_update_all();
}

void lcd_fill_Page(const unsigned char pattern,unsigned char startpage,unsigned char endpage)
 { unsigned char page, col;

   for (page=startpage; page<endpage; page++) 
    { for (col=0; col<LCD_X_BYTES; col++) 
         l_display_array[page][col]=pattern;
    }
   lcd_update_all();
 }

void lcd_erase(void)
 { lcd_fill(0x00);
   lcd_update_all();
 }

/*
**
** Updates area of the display. Writes data from "framebuffer" 
** RAM to the lcd display controller RAM.
** 
** Arguments Used:
**    top     top line of area to update.
**    bottom  bottom line of area to update.
**    from MJK-Code
**
*/
void lcd_update(const unsigned char top, const unsigned char bottom)
 { unsigned char x;
   unsigned char y;
   unsigned char yt;
   unsigned char yb;
   unsigned char *colptr;
   
   /* setup bytes of range */
   yb = bottom >> 3;
   yt = top >> 3;		

   for(y = yt; y <= yb; y++)
    { lcd_out_ctl(LCD_SET_PAGE+y,3);	/* set page */
//     lcd_out_ctl(LCD_SET_COL+LCD_STARTCOL_REVERSE,3);
     lcd_out_ctl(LCD_SET_COL+0,3);
      colptr = &l_display_array[y][0];

      for (x=0; x < LCD_X_BYTES; x++)
       { if ( x < LCD_X_BYTES/2 ) 
            lcd_out_dat(*colptr++,1);
         else 
            lcd_out_dat(*colptr++,2);
       }
    }
 }



void lcd_update_all(void)
 { 
   lcd_update(SCRN_TOP,SCRN_BOTTOM); 
 }



/* sets/clears/switchs(XOR) dot at (x,y) */
void lcd_dot(const unsigned char x, const unsigned char y, const unsigned char mode) 
 { unsigned char bitnum, bitmask, yByte;
   unsigned char *pBuffer; /* pointer used for optimisation */

   if ( ( x > SCRN_RIGHT ) || ( y > SCRN_BOTTOM ) ) return;

   yByte   = y >> 3; 
   bitnum  = y & 0x07;
   bitmask = l_mask_array[bitnum]; // bitmask = ( 1 << (y & 0x07) );
   pBuffer = &(l_display_array[yByte][x]);
   switch (mode) 
    { case LCD_MODE_SET:
         *pBuffer |= bitmask;
         break;
      case LCD_MODE_CLEAR:
         *pBuffer &= ~bitmask;
         break;
      case LCD_MODE_XOR:
         *pBuffer ^= bitmask;
         break;
	  case LCD_MODE_INVERT:
	  	 if((*pBuffer) & bitmask>0){
		 	*pBuffer &=~bitmask;
	  	 }else{
			*pBuffer |= bitmask;
		 }
		 break;
      default: break;
    }
 }


/* line- and circle-function from a KS0108-library by F. Thiele */

void lcd_line( uint8_t x1, uint8_t y1, uint8_t x2, uint8_t y2, const uint8_t mode ) 
 { uint8_t length, xTmp, yTmp, i, y, yAlt;
   int16_t m;

