nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/lcd/SED1520.c
/*
 Prints the given string at location x,y in the specified font.
 Prints each character given via calls to lcd_glyph. The entry string
 is null terminated. (adapted function from the MJK-code)
 Arguments are:
	left       coordinate of left start of string.
	top        coordinate of top of string.
	font       font number to use for display (see fonts.h)
	str        text string to display (null-terminated)
*/
#if 0
static void lcd_text_intern(uint8_t left, uint8_t top, uint8_t font, const char *str, uint8_t inprogmem)
 { uint8_t x = left;
   uint8_t glyph;
   uint8_t width;
   uint8_t height, defaultheight;
   uint8_t store_width;
   uint8_t *glyph_ptr;
   uint8_t *width_table_ptr;
   uint8_t *glyph_table_ptr;
   uint8_t glyph_beg, glyph_end;
   uint8_t fixedwidth;

   defaultheight = pgm_read_byte ( &(fonts[font].glyph_height) );
   store_width = pgm_read_byte ( &(fonts[font].store_width) );
   width_table_ptr = (uint8_t*) pgm_read_word( &(fonts[font].width_table) );
   glyph_table_ptr = (uint8_t*) pgm_read_word( &(fonts[font].glyph_table) );
   glyph_beg  = pgm_read_byte( &(fonts[font].glyph_beg) );
   glyph_end  = pgm_read_byte( &(fonts[font].glyph_end) );
   fixedwidth = pgm_read_byte( &(fonts[font].fixed_width) );

   if (inprogmem) 
      glyph = pgm_read_byte(str);
    
   else 
      glyph = (uint8_t)*str;
	
   while(glyph != 0x00) // while(*str != 0x00)
    { /* check to make sure the symbol is a legal one */
      /* if not then just replace it with the default character */
      if((glyph < glyph_beg) || (glyph > glyph_end))
         glyph = pgm_read_byte( &(fonts[font].glyph_def) ) ;

      /* make zero based index into the font data arrays */
      glyph -= glyph_beg;
      if(fixedwidth == 0)
         // width=fonts[font].width_table[glyph];	/* get the variable width instead */
         width=pgm_read_byte(width_table_ptr+glyph);
      else 
         width = fixedwidth;
		
      height = defaultheight;
      //glyph_ptr = fonts[font].glyph_table + ((unsigned int)glyph * (unsigned int)store_width * (unsigned int)height);
      glyph_ptr = glyph_table_ptr + ((unsigned int)glyph * (unsigned int)store_width * (unsigned int)height) ;

      /* range check / limit things here */
      if(x > SCRN_RIGHT)
         x = SCRN_RIGHT;
       
      if((x + width) > SCRN_RIGHT+1)
         width = SCRN_RIGHT - x + 1;
       
      if(top > SCRN_BOTTOM)
         top = SCRN_BOTTOM;
       
      if((top + height) > SCRN_BOTTOM+1)
         height = SCRN_BOTTOM - top + 1;
       
      lcd_glyph(x,top,width,height,glyph_ptr,store_width);  /* plug symbol into buffer */

      x += width;		/* move right for next character */
      str++;			/* point to next character in string */
      if (inprogmem) 
         glyph = pgm_read_byte(str);
      else 
         glyph = (uint8_t)*str;
       
    }
 }

/* draw string from RAM */
void lcd_text(uint8_t left, uint8_t top, uint8_t font, const char *str)
 { lcd_text_intern(left, top, font, str, 0);
 }

/* draw string from PROGMEM */
void lcd_text_p(uint8_t left, uint8_t top, uint8_t font, const char *str)
 { lcd_text_intern(left, top, font, str, 1);
 }

#endif



void lcd_bitmap(const uint8_t left, const uint8_t top, const struct IMG_DEF *img_ptr, const uint8_t mode)
{ 
	uint8_t width, heigth, h, w, pattern, mask;
	uint8_t* ptable;

	uint8_t bitnum,bitmask;
	uint8_t page,col,vdata;

	width  = img_ptr->width_in_pixels;
	heigth = img_ptr->height_in_pixels;
	ptable  =(uint8_t*)(img_ptr->char_table); 


	mask=0x80;
	pattern = *ptable;
	
	for ( h=0; h<heigth; h++ ){   /**/
		page=(h+top)>>3;
		bitnum=(h+top)&0x07;
		bitmask=(1<<bitnum);
		for ( w=0; w<width; w++ ) { 
			col=left+w;
			vdata=l_display_array[page][col];
			switch(mode){
				case LCD_MODE_SET:		/*不管原来的数据，直接设置为pattern的值*/
					if (pattern&mask)	
						vdata|=bitmask;
					else
						vdata&=~bitmask;
					break;
				case LCD_MODE_CLEAR:	/*不管原来的数据，清除原来的值=>0*/
					vdata&=~bitmask;	
					break;
				case LCD_MODE_XOR:		/*原来的数据，直接设置为pattern的值*/
					if(vdata&bitmask){
						if(pattern&mask)	vdata&=~bitmask;
						else vdata|=bitmask;
					}else{
						if(pattern&mask)	vdata|=bitmask;
						else vdata&=~bitmask;
					}
					break;
				case LCD_MODE_INVERT:	/*不管原来的数据，直接设置为pattern的值*/
					if (pattern&mask)	
						vdata&=~bitmask;
					else
						vdata|=bitmask;
					break;	 
						
			}
			l_display_array[page][col]=vdata;
			mask >>= 1;
			if ( mask == 0 ){ 
				mask = 0x80;
				ptable++;
				pattern = *ptable;
				
			}
		}
		if(mask!=0x80){		/*一行中的列已处理完*/
			mask = 0x80;
			ptable++;
			pattern = *ptable;
		}	
	}
}


/*
绘制12点阵的字符，包括中文和英文


*/
void lcd_text12(char left,char top ,char *p,char len,const char mode)
{
	int charnum=len;
	int i;
	char msb,lsb;
	
	int addr=0;
	unsigned char start_col=left;
	unsigned int  val_old, val_new, val_mask;

	unsigned int glyph[12];   /*保存一个字符的点阵信息，以逐列式*/	
	unsigned char 	font_buf[32];

	DF_TAKE;
	while( charnum )
	{
		for( i = 0; i < 12; i++ )
		{
			glyph[i] = 0;
		}
		msb = *p++;
		charnum--;
		if( msb <= 0x80 ) //ascii字符 0612
		{
		    
			 // select      font  on chip
			 //addr = ( msb - 0x20 ) * 12 + FONT_ASC0612_ADDR;   

			 //  slect    font  on   8Mbytes  Dataflash
			 addr = ( msb - 0x20 ) * 12 + FONT_ASC0612_ADDR;
			 SST25V_BufferRead( font_buf,addr,12);
			 addr = (int)font_buf;
			
			for( i = 0; i < 3; i++ )
			{
				val_new				= *(__IO uint32_t*)addr;
				glyph[i * 2 + 0]	= ( val_new & 0xffff );
				glyph[i * 2 + 1]	= ( val_new & 0xffff0000 )>>16;
				addr						+= 4;
			}
			
			val_mask=((0xfff)<<top);/*12bit*/

			/*加上top的偏移*/
			for( i = 0; i < 6; i++ )
			{
				glyph[i]<<=top;

				val_old=l_display_array[0][start_col]|(l_display_array[1][start_col]<<8)|(l_display_array[2][start_col]<<16)|(l_display_array[3][start_col]<<24);
				if(mode==LCD_MODE_SET)
				{
					val_new=val_old&(~val_mask)|glyph[i];
				}
				else if(mode==LCD_MODE_INVERT)
				{
					val_new=(val_old|val_mask)&(~glyph[i]);
				}
				l_display_array[0][start_col]=val_new&0xff;
				l_display_array[1][start_col]=(val_new&0xff00)>>8;
				l_display_array[2][start_col]=(val_new&0xff0000)>>16;
				l_display_array[3][start_col]=(val_new&0xff000000)>>24;
				start_col++;
			}
		}
		else
		{
			lsb = *p++;
			charnum--;
			if( ( msb >= 0xa1 ) && ( msb <= 0xa3 ) && ( lsb >= 0xa1 ) )
			{
			    // OUT flash
				addr = FONT_HZ1212_ADDR + ( ( ( (unsigned long)msb ) - 0xa1 ) * 94 + ( ( (unsigned long)lsb ) - 0xa1 ) ) * 24;
				SST25V_BufferRead( font_buf,addr,24);  
				addr = (int)font_buf;
				///CPU FLASH
				//addr = FONT_HZ1212_ADDR + ( ( ( (unsigned long)msb ) - 0xa1 ) * 94 + ( ( (unsigned long)lsb ) - 0xa1 ) ) * 24;
			}else if( ( msb >= 0xb0 ) && ( msb <= 0xf7 ) && ( lsb >= 0xa1 ) )
			{
					///OUT FLASH
					addr = FONT_HZ1212_ADDR + ( ( ( (unsigned long)msb ) - 0xb0 ) * 94 + ( ( (unsigned long)lsb ) - 0xa1 ) ) * 24 + 282 * 24;
					SST25V_BufferRead( font_buf,addr,24);
					addr = (int)font_buf;
					///CPU FLASH
					//addr = FONT_HZ1212_ADDR + ( ( ( (unsigned long)msb ) - 0xb0 ) * 94 + ( ( (unsigned long)lsb ) - 0xa1 ) ) * 24 + 282 * 24;
			}
			for( i = 0; i < 6; i++ )
			{
				val_new				= *(__IO uint32_t*)addr;
				glyph[i * 2 + 0]	= ( val_new & 0xffff );
				glyph[i * 2 + 1]	= ( val_new & 0xffff0000 )>>16;
				addr				+= 4;
			}
			val_mask=((0xfff)<<top);/*12bit*/

