nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/lcd/SED1520.c
			/*加上top的偏移*/
			for( i = 0; i < 12; i++ )
			{
				glyph[i]<<=top;
				/*通过start_col映射到I_display_array中，注意mask*/
				val_old=l_display_array[0][start_col]|(l_display_array[1][start_col]<<8)|(l_display_array[2][start_col]<<16)|(l_display_array[3][start_col]<<24);
				if(mode==LCD_MODE_SET)
				{
					val_new=val_old&(~val_mask)|glyph[i];
				}
				else if(mode==LCD_MODE_INVERT)
				{
					val_new=(val_old|val_mask)&(~glyph[i]);
				}
				l_display_array[0][start_col]=val_new&0xff;
				l_display_array[1][start_col]=(val_new&0xff00)>>8;
				l_display_array[2][start_col]=(val_new&0xff0000)>>16;
				l_display_array[3][start_col]=(val_new&0xff000000)>>24;
				start_col++;
			}

		}
	}  


  DF_RELEASE;

}

void lcd_text12_local(char left,char top ,char *p,char len,const char mode)
{
	int charnum=len;
	int i;
	char msb,lsb;
	u16  GB_Code=0;
	
	int addr=0;
	unsigned char start_col=left;
	unsigned int  val_old, val_new, val_mask;

	unsigned int glyph[12];   /*保存一个字符的点阵信息，以逐列式*/	
	unsigned char 	font_buf[32];

	DF_TAKE;
	while( charnum )
	{
		for( i = 0; i < 12; i++ )
		{
			glyph[i] = 0;
		}
		msb = *p++;
		charnum--;
		if( msb <= 0x80 ) //ascii字符 0612
		{
		     ;
		}
		else
		{
			lsb = *p++;
			charnum--;
            GB_Code=(msb<<8)+lsb;
             //----------------------------------------------------------
             switch(GB_Code)
             {
               case  0xC9E8:
							//  设C9E8
                            memcpy(font_buf,Dot_She,24);
							break;
			   case  0xB1B8:
							 // 备B1B8
							 memcpy(font_buf,Dot_Bei,24);
							 break;

				case  0xBCEC:
							 //检 BCEC
							 memcpy(font_buf,Dot_Jian,24);
							 break;

			   case  0xD7D4:
							 //自 D7D4 
			                 memcpy(font_buf,Dot_Zi,24);
							 break;
			  case  0xD5FD:
							 // 正D5FD
							 memcpy(font_buf,Dot_Zheng,24);
							 break;

			  case  0xB3A3: 
							 //  常 B3A3
							 memcpy(font_buf,Dot_Chang,24);
							 break;

			 case  0xCCEC:
							 // 天CCEC
							 memcpy(font_buf,Dot_Tian,24);
							 break;

			 case  0xCFDF:
							 // 线CFDF
							 memcpy(font_buf,Dot_Xian,24);
							 break;
			 case  0xBFAA:
							 // 开BFAA
							 memcpy(font_buf,Dot_Kai,24);  
							 break;				 
			 case  0xB6CC:
							 //路 B6CC
							 memcpy(font_buf,Dot_Lu,24); 
							 break;

			 case  0xC2B7:
							 //短C2B7
							 memcpy(font_buf,Dot_Duan,24);
							 break;

			 case  0xC4DA:
							 //  内C4DA
							 memcpy(font_buf,Dot_Nei,24);
							 break;

			 case  0xB2BF:
							 // 部B2BF
							 memcpy(font_buf,Dot_Bu,24);
							 break;

			 case  0xB5E7:
							 // 电B5E7
							 memcpy(font_buf,Dot_Dian,24);
							 break;

             case  0xB3D8:
							 // 池B3D8
							 memcpy(font_buf,Dot_Chi,24);
							 break;

            case  0xB9A9: 
							// 供B9A9
							 memcpy(font_buf,Dot_Gong,24); 
							 break;

			 default:
							 // .
							 memcpy(font_buf,Dot_dot,24);
							 break;
			 }

             addr = (int)font_buf;
			// OutPrint_HEX("汉字 点阵x",font_buf,24);
			 //-----------------------------------------------------------				
			for( i = 0; i < 6; i++ )
			{
				val_new				= *(__IO uint32_t*)addr;
				glyph[i * 2 + 0]	= ( val_new & 0xffff );
				glyph[i * 2 + 1]	= ( val_new & 0xffff0000 )>>16;
				addr				+= 4;
			}
			val_mask=((0xfff)<<top);/*12bit*/

			/*加上top的偏移*/
			for( i = 0; i < 12; i++ )
			{
				glyph[i]<<=top;
				/*通过start_col映射到I_display_array中，注意mask*/
				val_old=l_display_array[0][start_col]|(l_display_array[1][start_col]<<8)|(l_display_array[2][start_col]<<16)|(l_display_array[3][start_col]<<24);
				if(mode==LCD_MODE_SET)
				{
					val_new=val_old&(~val_mask)|glyph[i];
				}
				else if(mode==LCD_MODE_INVERT)
				{
					val_new=(val_old|val_mask)&(~glyph[i]);
				}
				l_display_array[0][start_col]=val_new&0xff;
				l_display_array[1][start_col]=(val_new&0xff00)>>8;
				l_display_array[2][start_col]=(val_new&0xff0000)>>16;
				l_display_array[3][start_col]=(val_new&0xff000000)>>24;
				start_col++;
			}

		}
	}  


  DF_RELEASE;

}



